Public Attributes | List of all members
API_DatabaseUnId Struct Reference
Database Manager
Identification parameters of a Section, Detail, Interior Elevation, Worksheet, Master Layout, Layout, and 3D Document window or window related database. More...
#include <APIdefs_Database.h>
 Public Attributes
 API_Guid  | elemSetId
Unique identifier.
Detailed Description
Identification parameters of a Section, Detail, Interior Elevation, Worksheet, Master Layout, Layout, and 3D Document window or window related database.
Remarks
Use ACAPI_Database_GetGuidFromDBUnId function to convert the old database identifiers to this new one. Use ACAPI_Database_GetDBUnIdFromGuid to get old identifiers from this.